In [1]:
import sqlite3
conn = sqlite3.connect("people.db") 
cursor = conn.cursor()

cursor.execute("""
CREATE TABLE role (
    id INTEGER PRIMARY KEY,
    name TEXT
)""")

cursor.execute("INSERT INTO role VALUES (1, 'Instructor')") 
cursor.execute("INSERT INTO role VALUES (2, 'TA')") 
cursor.execute("INSERT INTO role VALUES (3, 'Student')") 
conn.commit()

cursor.execute("DELETE FROM role WHERE id == 3")
conn.commit()

conn.close()

In [2]:
import pandas as pd
conn = sqlite3.connect("people.db") 
cursor = conn.cursor()

#for row in cursor.execute('SELECT * FROM role'): print(row)
cursor.execute("INSERT INTO role VALUES (3, 'Student')") 
conn.commit()

data = pd.read_sql_query("SELECT * FROM role", conn, index_col="id")
conn.close()

In [3]:
data

          name
id
1   Instructor
2           TA
3      Student